УТ/src/Catalogs/CRM_УчетныеЗаписиМессенджеров/CRM_УчетныеЗаписиМессенджеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>CRM_УчетныеЗаписиМессенджеров</name>
  <predefined>
    <items>
      <name>B2BПортал</name>
      <description>B2B портал</description>
    </items>
    <items>
      <name>СистемаВзаимодействия</name>
      <description>Система взаимодействия</description>
    </items>
  </predefined>
  <attributes>
    <name>CRM_ВариантАвтосозданияКлиентов</name>
    <comment>АПК:1032 АПК:265 не проверять на орфографию синоним и имя</comment>
    <type>
      <types>EnumRef.CRM_ВариантыАвтосозданияКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИсточникЛидов</name>
    <comment>АПК:265 не проверять на орфографию имя</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОбрабатыватьОбращения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПартнерГруппа</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ПартнерСтатусРаботы</name>
    <type>
      <types>CatalogRef.CRM_СтатусыРаботыСКлиентом</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РольОтветственного</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СоздаватьПартнера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СрокЖизниОбращения</name>
    <comment>Время жизни обращения (дней)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СрокОбработкиДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СрокОбработкиМинут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СрокОбработкиЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_УказыватьПричинуОтклонения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Включена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьWebhook</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодWebhook</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПароль</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПользователь</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиСервер</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьПросмотрСообщенийВсемПользователям</name>
    <comment>Разрешить просмотр сообщений всем пользователям, независимо от настройки доступа</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипМессенджера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификаторЗадания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловияИспользованияПриняты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеПараметровДоступа</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>CRM_ПравилаОбработки</name>
    <attributes>
      <name>УсловиеОбработки</name>
      <type>
        <types>CatalogRef.CRM_УсловияОбработкиОбращений</types>
      </type>
    </attributes>
    <attributes>
      <name>ПравилоОбработки</name>
      <type>
        <types>CatalogRef.CRM_ПравилаОбработкиОбращений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_Сценарии</name>
    <attributes>
      <name>Сценарий</name>
      <type>
        <types>CatalogRef.CRM_СостоянияИнтересов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ/src/Catalogs/CRM_УчетныеЗаписиМессенджеров/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет предопределенные параметры
//
Процедура ЗаполнитьПредопределенныеЭлементы() Экспорт
	
	ЭлементОбъект = Справочники.CRM_УчетныеЗаписиМессенджеров.СистемаВзаимодействия.ПолучитьОбъект();
	ЭлементОбъект.ТипМессенджера = "СистемаВзаимодействия";
	ЭлементОбъект.Наименование = НСтр("ru = 'Обсуждение'");
	ЭлементОбъект.Записать();
	
	ЭлементОбъект = Справочники.CRM_УчетныеЗаписиМессенджеров.B2BПортал.ПолучитьОбъект();
	ЭлементОбъект.ТипМессенджера = "B2BПортал";
	ЭлементОбъект.Наименование = НСтр("ru = 'B2B портал'");
	ЭлементОбъект.Записать();
	
КонецПроцедуры

// Функция возвращает Истина, если удалось установить Webhook Green.
//
// Параметры:
//  УчетнаяЗапись				 - СправочинкСсылка.CRM_УчетныеЗаписиМессенджеров	 - Учетная запись.
//  СтруктураПараметровДоступа	 - Структура										 - Структура параметров.
//  ТекстОшибки					 - Строка											 - Текст ошибки.
// 
// Возвращаемое значение:
//   - Булево
//
Функция УстановитьWebhookGreen(УчетнаяЗапись, СтруктураПараметровДоступа, ТекстОшибки = "") Экспорт
	
	Если ЗначениеЗаполнено(СтруктураПараметровДоступа.АдресWebhook) Тогда
		АдресWebhook = СтруктураПараметровДоступа.АдресWebhook;
		АдресWebhook = АдресWebhook + ?(Прав(АдресWebhook, 1) = "/", "", "/") 
			+ Строка(УчетнаяЗапись.Ссылка.УникальныйИдентификатор());
	Иначе
		АдресWebhook = "";
	КонецЕсли;
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("webhookUrl", АдресWebhook);
	СтруктураНастроек.Вставить("incomingWebhook", "yes");
	СтруктураНастроек.Вставить("outgoingWebhook", "yes");
	СтруктураНастроек.Вставить("deviceWebhook", "yes");
	СтруктураНастроек.Вставить("stateWebhook", "yes");
	СтруктураНастроек.Вставить("markIncomingMessagesReaded", "no");
	СтруктураНастроек.Вставить("outgoingMessageWebhook", "yes");
	
	СтрокаЗапроса = CRM_РаботаСМессенджерамиСервер.ПолучитьСтрокуJSON(СтруктураНастроек, Истина);
	
	СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(CRM_РаботаСМессенджерамиСервер.ВыполнитьЗапрос(Обработки.CRM_РаботаСМессенджеромWhatsApp.СерверGreen(),
		 СтрокаЗапроса
		, Обработки.CRM_РаботаСМессенджеромWhatsApp.URLМетодаСервисаGreen(СтруктураПараметровДоступа.ApiURL, СтруктураПараметровДоступа.Токен, "setSettings"), СтруктураПараметровДоступа.ПараметрыПрокси));
		
	Если СтруктураОтвета.Свойство("saveSettings")	Тогда
		Возврат СтруктураОтвета.saveSettings;
	Иначе       
		ТекстОшибки = (?(СтруктураОтвета.Свойство("error"), "Не удалось сохранить настройки по причине : " 
			+ СтруктураОтвета.error,
			 "Не удалось сохранить настройки!"));
		//ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
